# Timing constraints

# System clock is generated by MMCM by module crg.
# It's timing constraints are in clkgen_50mhz.xdc

# JTAG
create_clock -period 100.000 -name TCK -waveform {0.000 50.000} [get_ports tck]

set_input_delay -clock [get_clocks TCK] -clock_fall 0.000 [get_ports {trst_n tms tdi}]
set_output_delay -clock [get_clocks TCK] 0.000 [get_ports tdo]

set_clock_groups -asynchronous -group {TCK}